print("Привіт! відповідай на запитання як знаєш! Усі відповіді пиши з великої букви.")
ball = 0

answer1 = input("Столиця Франції: ")
if answer1 == "Париж":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! Правильна віподвідь Париж!")


print("Йдемо далі!")
answer2 = input("Хто написав «Кобзар» (тільки прізвище): ")
if answer2 == "Шевченко":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! Правильна віподвідь: Шевченко!")


print("Йдемо далі!")
answer3 = input("Який найбільший океан на Землі (тільки назва): ")
if answer3 == "Тихий":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! Правильна віподвідь: Тихий!")


print("Йдемо далі!")
answer4 = input("Яка планета найближча до Сонця?: ")
if answer4 == "Меркурій":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! Правильна віподвідь: Меркурій!")


print("Йдемо далі!")
answer5 = input("Хто перший президент України (тільки прізвище)?: ")
if answer5 == "Кравчук":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! Правильна віподвідь: Кравчук!")


print("Йдемо далі!")
answer6 = input("Яка столиця Італії?: ")
if answer6 == "Рим":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! Правильна віподвідь: Рим!")


print("Йдемо далі!")
answer7 = input("Хто відкрив Америку?: ")
if answer7 == "Колумб":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! Правильна віподвідь: Колумб!")


print("Йдемо далі!")
answer8 = input("Яка найшвидша наземна тварина?: ")
if answer8 == "Гепард":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! Правильна віподвідь: Гепард!")


print("Йдемо далі!")
answer9 = input("Яка найвища гора світу?: ")
if answer9 == "Еверест":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! Правильна віподвідь: Еверест!")


print("Йдемо далі!")
answer10 = input("Яка столиця Японії?: ")
if answer10 == "Токіо":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! Правильна віподвідь: Токіо!")

print("Йдемо далі!")
answer11 = input("Який метал найкраще проводить електрику?: ")
if answer11 == "Срібло":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! Правильна віподвідь: Срібло!")


print("Йдемо далі!")
answer12 = input("Який птах не вміє літати?: ")
if answer12 == "Пінгвін":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! Правильна віподвідь: Пінгвін!")


print(f"Гра закінчена! Ви набрали {ball} балів з 12!")