print("Привіт! відповідай на запитання як знаєш!")
ball = 0

answer1 = input("Столиця Франції: ")
if answer1 == "Париж":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! - 1 бал. Правильна віподвідь Париж!")
    ball = ball - 1


print("Йдемо далі!")
answer2 = input("Хто написав «Кобзар» (тільки прізвище): ")
if answer2 == "Шевченко":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! - 1 бал. Правильна віподвідь: Шевченко!")
    ball = ball - 1


print("Йдемо далі!")
answer3 = input("Який найбільший океан на Землі (тільки назва): ")
if answer3 == "Тихий":
    print("Правильно! + 1 бал")
    ball = ball + 1
else:
    print("Неправильно! - 1 бал. Правильна віподвідь: Тихий!")
    ball = ball - 1


print(f"Гра закінчена! Ви набрали {ball} балів!")

