list = {"сонце": "sun",
        "кіт": "cat",
        "дерево": "tree",
        "книга": "book",
        "школа": "school",
        "друг": "friend",
        "їжа": "food",
        "музика": "music",
        "річка": "river",
        "мрія": "dream"}
word = input("Це перекладач. Введіть слово українською, яке ви хочете перекласти на англійську: ")
if word == "сонце":
    print("Ось переклад:", list["сонце"])
if word == "кіт":
    print("Ось переклад:", list["кіт"])
if word == "дерево":
    print("Ось переклад:", list["дерево"])
if word == "книга":
    print("Ось переклад:", list["книга"])
if word == "школа":
    print("Ось переклад:", list["школа"])
if word == "друг":
    print("Ось переклад:", list["друг"])
if word == "їжа":
    print("Ось переклад:", list["їжа"])
if word == "музика":
    print("Ось переклад:", list["музика"])
if word == "річка":
    print("Ось переклад:", list["річка"])
if word == "мрія":
    print("Ось переклад:", list["мрія"])



