# Використовуючи цикл while, виведіть у стовпчик рядки виду “Олімпіада year року”, де year - це число, яке набуває значень, починаючи від 1980 до 2023, з кроком збільшення рівним 4.
# Тобто на першій ітерації циклу, year дорівнює 1980, а на кожній наступній ітерації значення year збільшується на 4. Рядки такого вигляду виводяться доти, поки значення year не стане більше 2025.
#
#
# Приклад:
# year = 1980, вивод має бути таким:
# Олімпіада 1980 року
# Олімпіада 1984 року
# Олімпіада 1988 року
# Олімпіада 1992 року
# ……
# Олімпіада 2016 року
# Олімпіада 2020 року

year = 1980
while year < 2025:
    print(f"Олімпіада {year} року")
    year += 4