# Оголоси функцію, яка не приймає жодних параметрів.
# Всередині функції:
# оголоси змінну greeting та присвой їй значення — рядок "JustSchool!";
# поверни змінну greeting за допомогою ключового слова return
#
# А тепер створи функцію, яка:
# приймає параметр name;
# повертає рядок-привітання у вигляді Hi, {name}! (використай ключове слово return)
# Ви створюєте конвертер градусів Цельсія у градуси Фаренгейта.
# Напишіть функцію, яка використовує градуси Цельсія як аргумент та видасть відповідне значення у градусах Фаренгейта.
# Приклад даних
# 36, 50, 120
# Приклад результату
# 96.8, 122, 248


# 1
def greetf():
    greeting = "JustSchool!"
    return greeting

print(greetf())



# 2
name = input()
def greetf2(name):
    return print(f"Hi, {name}!")

greetf2(name)



# 3
cel = int(input())
def convertor(cel):
    return int(cel * 1.8 + 32)

print(convertor(cel))















































